Changed plan to use a single Hetzner Service as Server with Dockerization. Concentrated plan to accelerate Minimum viable Product.
